S-Batov/STM32_MCU_module/Core/Inc/ucc5870_regs.h
/**
 * @file UCC5870_regs.h
 * @brief Header file for UCC5870 Registers and bit field definitions
 */

#ifndef _UCC5870_REGS_H
#define _UCC5870_REGS_H

#include <stdint.h>

/*****************************************************************************/
// Register Addresses
/*****************************************************************************/
//UCC5870 Register Addresses
#define  CFG1            0x00
#define  CFG2            0x01
#define  CFG3            0x02
#define  CFG4            0x03
#define  CFG5            0x04
#define  CFG6            0x05
#define  CFG7            0x06
#define  CFG8            0x07
#define  CFG9            0x08
#define  CFG10           0x09
#define  CFG11           0x0a
#define  ADCDATA1        0x0b
#define  ADCDATA2        0x0c
#define  ADCDATA3        0x0d
#define  ADCDATA4        0x0e
#define  ADCDATA5        0x0f
#define  ADCDATA6        0x10
#define  ADCDATA7        0x11
#define  ADCDATA8        0x12
#define  CRCDATA         0x13
#define  SPITEST         0x14
#define  GD_ADDR         0x15
#define  STATUS1         0x16
#define  STATUS2         0x17
#define  STATUS3         0x18
#define  STATUS4         0x19
#define  STATUS5         0x1a
#define  CONTROL1        0x1b
#define  CONTROL2        0x1c
#define  ADCCFG          0x1d
#define  DOUTCFG         0x1e

//
// =============================================================================
// =============================================================================
//      REGISTER BIT FIELD DEFINITIONS
// =============================================================================
// =============================================================================
//
// UCC5870 CFG1 Register bit definitions:
//
struct UCC5870_CFG1_REG_BITS {  // bit     description
	uint16_t TDEAD :6;          //  5:0    dead time
	uint16_t NFLT2_DOUT_MUX :1; //  6	   nFLT2/DOUT pin function
	uint16_t rsvd7 :1;          //  7      PVDD ov flag
	uint16_t OV1_DIS :1;        //  8      VCC1 OVLO disable
	uint16_t rsvd9 :1;          //  9      PVDD ov flag
	uint16_t GD_TWN_DIS :1;     // 10	   OTW VCC1 side
	uint16_t IO_DEGLITCH :2;    // 12:11   IN deglitch time
	uint16_t OVLO1_LEVEL :1;    // 13      VCC1 OVLO setting
	uint16_t UVLO1_LEVEL :1;    // 14      VCC1 UVLO setting
	uint16_t UV1_DIS :1;        // 15      VCC1 UVLO disable
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG1_REG_BITS bit;
} UCC5870_CFG1_REG;

#define  Tdead(T)   ( ((T-105)/70) + 1)   // T in ns

enum {
	nFLT2_DOUT_nFLT2 = 0, nFLT2_DOUT_DOUT = 1 // all warnings of nFLT2 output on nFLT1
};

enum {
	vcc1_ovlo_enable = 0, vcc1_ovlo_disable = 1
};

enum {
	OT_warning_enable = 0, OT_warning_disable = 1
};

enum {
	io_deglitch_bypass = 0,
	io_deglitch_70ns = 1,
	io_deglitch_140ns = 2,
	io_deglitch_210ns = 3
};

enum {
	vcc1_3V3 = 0, vcc1_5v0 = 1
};

enum {
	vcc1_uvlo_enable = 0, vcc1_uvlo_disable = 1
};

// ==================================================================

//
// UCC5870 CFG2 Register bit definitions:
//
struct UCC5870_CFG2_REG_BITS {       // bit    description
	uint16_t PWM_CHK_FAULT :1;       //  0      PWM check fault
	uint16_t VREG1_ILIMIT_FAULT :1;  //  1      Vreg Ilimit fault
	uint16_t GD_TWN_FAULT :1;        //  2      temp warning fault
	uint16_t rsvd :2;                //  4-3
	uint16_t BIST_FAULT :1;          //  5      Analog BIST fault
	uint16_t TRIM_CRC_FAULT :1;      //  6      TRIM CRC fault
	uint16_t INT_REG_FAULT :1;       //  7      Internal regulator fault
	uint16_t CFG_CRC_FAULT :1;       //  8      CFG reg CRC fault
	uint16_t SPI_FAULT :2;           // 10-9    SPI fault
	uint16_t CLK_MON_FAULT :1;       // 11      Clock monitor fault
	uint16_t STP_FAULT :1;           // 12      STP fault
	uint16_t UVLO1_FAULT :1;         // 13      UVLO fault
	uint16_t OVLO1_FAULT :1;         // 14      OVLO fault
	uint16_t INT_COMM_FAULT :1;      // 15      Inter-die comm failure
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG2_REG_BITS bit;
} UCC5870_CFG2_REG;

enum {
	report_fault_on_nFLT1 = 0, dont_report_fault_on_nFLT1 = 1
};

enum {
	dont_report_comm_fault_on_nFLT1 = 0, report_comm_fault_on_nFLT1 = 1
};

enum {
	no_warning_on_nFLT1 = 0, warning_on_nFLT1 = 1
};

enum {
	report_SPI_fault_on_nFLT1 = 0,
	report_SPI_fault_on_nFLT2 = 1,
	dont_report_SPI_fault = 2
};

// ==================================================================

//
// UCC5870 CFG3 Register bit definitions:
//
struct UCC5870_CFG3_REG_BITS {           // bit     description
	uint16_t AI_IZTC_SEL :3;             //  2:0
	uint16_t FS_STATE_CFG_CRC_FAULT :1;  //  3
	uint16_t ITO2_EN :1;                 //  4
	uint16_t ITO1_EN :1;                 //  5
	uint16_t FS_STATE_INT_COMM_FAULT :1; //  6
	uint16_t FS_STATE_INT_REG_FAULT :1;  //  7
	uint16_t FS_STATE_SPI_FAULT :2;      //  9:8
	uint16_t rsvd10 :1;                  // 10
	uint16_t FS_STATE_STP_FAULT :2;      // 12:11
	uint16_t FS_STATE_PWM_CHK :1;        // 13
	uint16_t FS_STATE_OVLO1_FAULT :1;    // 14
	uint16_t FS_STATE_UVLO1_FAULT :1;    // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG3_REG_BITS bit;
} UCC5870_CFG3_REG;

enum {
	AI1_AI3_AI5_bias_currents_off = 0,
	AI1_bias_current_on = 1,
	AI3_bias_current_on = 2,
	AI1_AI3_bias_currents_on = 3,
	AI5_bias_current_on = 4,
	AI1_AI5_bias_currents_on = 5,
	AI3_AI5_bias_currents_on = 6,
	AI1_AI3_AI5_bias_currents_on = 7
};

enum {
	OUTx_LOW = 0, OUTx_IGNORE = 1
};

enum {
	FS_SPI_OUTx_LOW = 0, FS_SPI_OUTx_HIGH = 1, FS_SPI_OUTx_IGNORE = 2
};

enum {
	FS_STP_OUTx_LOW = 0, FS_STP_OUTx_HIGH = 1, FS_STP_OUTx_IGNORE = 3
};

enum {
	CURRENT_SRC_OUT_AI2_4_6_DISABLED = 0, CURRENT_SRC_OUT_AI2_4_6_ENABLED = 1
};

enum {
	CURRENT_SRC_OUT_AI1_3_5_DISABLED = 0, CURRENT_SRC_OUT_AI1_3_5_ENABLED = 1
};

// ==================================================================

//
// UCC5870 CFG4 Register bit definitions:
//
struct UCC5870_CFG4_REG_BITS {   // bit     description
	uint16_t UVOV3_EN :1;        //  0
	uint16_t PS_TSD_EN :1;       //  1
	uint16_t OCP_DIS :1;         //  2
	uint16_t SCP_DIS :1;         //  3
	uint16_t DESAT_EN :1;        //  4
	uint16_t VCECLP_EN :1;       //  5
	uint16_t MCLP_DIS :1;        //  6
	uint16_t GM_EN :1;           //  7
	uint16_t GM_BLK :2;          //  9:8
	uint16_t MCLP_CFG :1;        // 10
	uint16_t OV2_DIS :1;         // 11
	uint16_t DESAT_DEGLITCH :1;  // 12
	uint16_t PS_TSD_DEGLITCH :2; // 14:13
	uint16_t UV2_DIS :1;         // 15
};

