S-Batov/STM32_MCU_module/Core/Inc/ucc5870_regs.h
typedef union {
	uint16_t all;
	struct UCC5870_CFG4_REG_BITS bit;
} UCC5870_CFG4_REG;

enum {
	VEE2_uvlo_ovlo_disable = 0, VEE2_uvlo_ovlo_enable = 1
};

enum {
	Switch_thermal_SD_disable = 0, Switch_thermal_SD_enable = 1
};

enum {
	OCP_enable = 0, OCP_disable = 1
};

enum {
	SCP_enable = 0, SCP_disable = 1
};

enum {
	DESAT_det_disable = 0, DESAT_det_enable = 1
};

enum {
	VCE_CLAMP_disable = 0, VCE_CLAMP_enable = 1
};

enum {
	MILLER_CLAMP_enable = 0, MILLER_CLAMP_disable = 1
};

enum {
	Gate_Volt_Mon_enable = 0, Gate_Volt_Mon_disable = 1
};

enum {
	Gate_volt_mon_blank_500ns = 0,
	Gate_volt_mon_blank_1000ns = 1,
	Gate_volt_mon_blank_2500ns = 2,
	Gate_volt_mon_blank_4000ns = 3
};

enum {
	MILLER_CLAMP_internal = 0, MILLER_CLAMP_external = 1
};

enum {
	VCC2_ovlo_enable = 0, VCC2_ovlo_disable = 1
};

enum {
	DESAT_deglitch_158ns = 0, DESAT_deglitch_316ns = 1
};

enum {
	TSD_250ns = 0, TSD_500ns = 1, TSD_750ns = 2, TSD_1000ns = 3
};

enum {
	VCC2_uvlo_enable = 0, VCC2_uvlo_disable = 1
};

// ==================================================================

//
// UCC5870 CFG5 Register bit definitions:
//
struct UCC5870_CFG5_REG_BITS {  // bit     description
	uint16_t PWM_MUTE_EN :1;    //  0
	uint16_t TLTOFF_STO_EN :3;  //  3:1
	uint16_t STO_CURR :2;       //  5:4
	uint16_t MCLPTH :2;         //  7:6
	uint16_t DESAT_DCHG_EN :1;  //  8
	uint16_t DESAT_CHG_CURR :2; // 10:9
	uint16_t DESATTH :4;        // 14:11
	uint16_t GM_STO2LTO_DIS :1; // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG5_REG_BITS bit;
} UCC5870_CFG5_REG;

enum {
	PWM_MUTE_FOR_SC_OC_OT_FAULTS_DISABLED = 0,
	PWM_MUTE_FOR_SC_OC_OT_FAULTS_ENABLED = 1
};

enum {
	STO_2LTOFF_DISABLED = 0,
	STO_FOR_SC_DESAT = 1,
	STO_FOR_SC_DESAT_OC = 2,
	STO_FOR_SC_DESAT_OC_TSD = 3,
	TLTOFF_FOR_SC_DESAT = 5,
	TLTOFF_FOR_SC_DESAT_OC = 6,
	TLTOFF_FOR_SC_DESAT_OC_TSD = 7
};

enum {
	SOFT_TURN_OFF_0_3A = 0,
	SOFT_TURN_OFF_0_6A = 1,
	SOFT_TURN_OFF_0_9A = 2,
	SOFT_TURN_OFF_1_2A = 3
};

enum {
	MILLER_CLAMP_VTH_1p5V = 0,
	MILLER_CLAMP_VTH_2V = 1,
	MILLER_CLAMP_VTH_3V = 2,
	MILLER_CLAMP_VTH_4V = 3
};

enum {
	DESAT_DISCHARGE_DISABLE = 0, DESAT_DISCHARGE_ENABLE = 1
};

enum {
	BLANK_CAP_CHRG_CUR_600uA = 0,
	BLANK_CAP_CHRG_CUR_700uA = 1,
	BLANK_CAP_CHRG_CUR_800uA = 2,
	BLANK_CAP_CHRG_CUR_1000uA = 3,
};

enum {
	DESAT_VTH_2p5 = 0,
	DESAT_VTH_3p0 = 1,
	DESAT_VTH_3p5 = 2,
	DESAT_VTH_4p0 = 3,
	DESAT_VTH_4p5 = 4,
	DESAT_VTH_5p0 = 5,
	DESAT_VTH_5p5 = 6,
	DESAT_VTH_6p0 = 7,
	DESAT_VTH_6p5 = 8,
	DESAT_VTH_7p0 = 9,
	DESAT_VTH_7p5 = 10,
	DESAT_VTH_8p0 = 11,
	DESAT_VTH_8p5 = 12,
	DESAT_VTH_9p0 = 13,
	DESAT_VTH_9p5 = 14,
	DESAT_VTH_10p0 = 15,
};

enum {
	GATE_MON_FLT_DURING_STO_TLTOFF_ENABLED = 0,
	GATE_MON_FLT_DURING_STO_TLTOFF_DISABLED = 1
};
// ==================================================================

//
// UCC5870 CFG6 Register bit definitions:
//
struct UCC5870_CFG6_REG_BITS { // bit     description
	uint16_t PS_TSDTH :3;      //  2:0
	uint16_t TEMP_CURR :2;     //  4:3
	uint16_t OC_BLK :3;        //  7:5
	uint16_t SC_BLK :2;        //  9:8
	uint16_t SCTH :2;          // 11:10
	uint16_t OCTH :4;          // 15:12
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG6_REG_BITS bit;
} UCC5870_CFG6_REG;

enum {
	TSD_TH_1p00 = 0,
	TSD_TH_1p25 = 1,
	TSD_TH_1p50 = 2,
	TSD_TH_1p75 = 3,
	TSD_TH_2p00 = 4,
	TSD_TH_2p25 = 5,
	TSD_TH_2p50 = 6,
	TSD_TH_2p75 = 7
};

enum {
	TEMP_CURR_0p1A = 0,
	TEMP_CURR_0p3A = 1,
	TEMP_CURR_0p5A = 2,
	TEMP_CURR_1p0A = 3
};

enum {
	OCD_BLANK_TIME_0p5us = 0,
	OCD_BLANK_TIME_1p0us = 1,
	OCD_BLANK_TIME_1p5us = 2,
	OCD_BLANK_TIME_2p0us = 3,
	OCD_BLANK_TIME_2p5us = 4,
	OCD_BLANK_TIME_3p0us = 5,
	OCD_BLANK_TIME_5p0us = 6,
	OCD_BLANK_TIME_10p0us = 7
};

enum {
	SCD_BLANK_TIME_0p1us = 0,
	SCD_BLANK_TIME_0p2us = 1,
	SCD_BLANK_TIME_0p4us = 2,
	SCD_BLANK_TIME_0p8us = 3
};

enum {
	SCD_VTH_0p5V = 0, SCD_VTH_0p75V = 1, SCD_VTH_1p0V = 2, SCD_VTH_1p25V = 3
};

enum {
	OCD_VTH_0p2V = 0,
	OCD_VTH_0p25V = 1,
	OCD_VTH_0p3V = 2,
	OCD_VTH_0p35V = 3,
	OCD_VTH_0p4V = 4,
	OCD_VTH_0p45V = 5,
	OCD_VTH_0p5V = 6,
	OCD_VTH_0p55V = 7,
	OCD_VTH_0p6V = 8,
	OCD_VTH_0p65V = 9,
	OCD_VTH_0p7V = 10,
	OCD_VTH_0p75V = 11,
	OCD_VTH_0p8V = 12,
	OCD_VTH_0p85V = 13,
	OCD_VTH_0p9V = 14,
	OCD_VTH_0p95V = 15
};

// ==================================================================

//
// UCC5870 CFG7 Register bit definitions:
//
struct UCC5870_CFG7_REG_BITS {      // bit     description
	uint16_t FS_STATE_ADC_FAULT :2; // 1:0
	uint16_t ADC_FAULT_P :1;        //  2
	uint16_t ADC_SAMP_DLY :2;       //  4:3
	uint16_t ADC_SAMP_MODE :2;      //  6:5
	uint16_t ADC_EN :1;             //  7
	uint16_t OVLO3TH :2;            //  9:8
	uint16_t UVLO3TH :2;            // 11:10
	uint16_t OVLO2TH :2;            // 13:12
	uint16_t UVLO2TH :2;            // 15:14
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG7_REG_BITS bit;
} UCC5870_CFG7_REG;

enum {
	FS_ADC_FLT_OUT_LOW = 0,
	FS_ADC_FLT_OUT_HIGH = 1,
	FS_ADC_FLT_OUT_HiZ = 2,
	FS_ADC_FLT_OUT_IGNORE = 3
};

enum {
	dont_report_adcfault_on_nFLT1 = 0, report_adcfault_on_nFLT1 = 1
};

enum {
	ADC_SAMP_DELAY_280ns = 0,
	ADC_SAMP_DELAY_560ns = 1,
	ADC_SAMP_DELAY_840ns = 2,
	ADC_SAMP_DELAY_1120ns = 3
};

enum {
	ADC_SAMP_CENTER_ALIGN = 0,
	ADC_SAMP_EDGE_ALIGN = 1,
	ADC_SAMP_CENTER_HYBRID = 2,
	ADC_SAMP_RESERVED = 3
};

enum {
	ADC_SAMP_DISABLE = 0, ADC_SAMP_ENABLE = 1
};

enum {
	VEE2_OVLO_VTH_M5V = 0,
	VEE2_OVLO_VTH_M7V = 1,
	VEE2_OVLO_VTH_M10V = 2,
	VEE2_OVLO_VTH_M12V = 3
};

enum {
	VEE2_UVLO_VTH_M3V = 0,
	VEE2_UVLO_VTH_M5V = 1,
	VEE2_UVLO_VTH_M8V = 2,
	VEE2_UVLO_VTH_M10V = 3
};

enum {
	VCC2_OVLO_VTH_P23V = 0,
	VCC2_OVLO_VTH_P21V = 1,
	VCC2_OVLO_VTH_P19V = 2,
	VCC2_OVLO_VTH_P17V = 3
};

enum {
	VCC2_UVLO_VTH_P16V = 0,
	VCC2_UVLO_VTH_P14V = 1,
	VCC2_UVLO_VTH_P12V = 2,
	VCC2_UVLO_VTH_P10V = 3
};

// ==================================================================

//
// UCC5870 CFG8 Register bit definitions:
//
struct UCC5870_CFG8_REG_BITS {    // bit     description
	uint16_t IOUT_SEL :3;         //  2:0
	uint16_t AI_ASC_MUX :1;       //  3
	uint16_t VREF_SEL :1;         //  4
	uint16_t GD_2LOFF_STO_EN :1;  //  5
	uint16_t CRC_DIS :1;          //  6
	uint16_t rsvd7 :1;            //  7
	uint16_t GD_2LOFF_CURR :2;    //  9:8
	uint16_t GD_2LOFF_TIME :3;    // 12:10
	uint16_t GD_2LOFF_VOLT :3;    // 15:13
};

