S-Batov/STM32_MCU_module/Core/Inc/ucc5870_regs.h
typedef union {
	uint16_t all;
	struct UCC5870_CFG8_REG_BITS bit;
} UCC5870_CFG8_REG;

enum {
	GATE_DRIVE_STRENGTH_FULL = 0,
	GATE_DRIVE_STRENGTH_3rd = 1,
	GATE_DRIVE_STRENGTH_6th = 2
};

enum {
	AI_ASC_MUX_ASC = 0, AI_ASC_MUX_AI = 1
};

enum {
	VREF_INTERNAL = 0, VREF_EXTERNAL = 1
};

enum {
	GD_2LOFF_STO_DISABLE = 0, GD_2LOFF_STO_ENABLE = 1
};

enum {
	CRC_CHECK_ENABLE = 0, CRC_CHECK_DISABLE = 1
};

enum {
	GD_2LOFF_DISCHARGE_CURR_0p3A = 0,
	GD_2LOFF_DISCHARGE_CURR_0p6A = 1,
	GD_2LOFF_DISCHARGE_CURR_0p9A = 2,
	GD_2LOFF_DISCHARGE_CURR_1p2A = 3
};

enum {
	GD_2LOFF_PLATEAU_TIME_150ns = 0,
	GD_2LOFF_PLATEAU_TIME_300ns = 1,
	GD_2LOFF_PLATEAU_TIME_450ns = 2,
	GD_2LOFF_PLATEAU_TIME_600ns = 3,
	GD_2LOFF_PLATEAU_TIME_1000ns = 4,
	GD_2LOFF_PLATEAU_TIME_1500ns = 5,
	GD_2LOFF_PLATEAU_TIME_2000ns = 6,
	GD_2LOFF_PLATEAU_TIME_2500ns = 7
};

enum {
	GD_2LOFF_PLATEAU_VOLT_6V = 0,
	GD_2LOFF_PLATEAU_VOLT_7V = 1,
	GD_2LOFF_PLATEAU_VOLT_8V = 2,
	GD_2LOFF_PLATEAU_VOLT_9V = 3,
	GD_2LOFF_PLATEAU_VOLT_10V = 4,
	GD_2LOFF_PLATEAU_VOLT_11V = 5,
	GD_2LOFF_PLATEAU_VOLT_12V = 6,
	GD_2LOFF_PLATEAU_VOLT_13V = 7

};
// ==================================================================

//
// UCC5870 CFG9 Register bit definitions:
//
struct UCC5870_CFG9_REG_BITS {       // bit     description
	uint16_t CLK_MON_SEC_FAULT :1;   //  0
	uint16_t VREG2_ILIMIT_FAULT :1;  //  1
	uint16_t BIST_SEC_FAULT :1;      //  2
	uint16_t INT_REG_SEC_FAULT :1;   //  3
	uint16_t TRIM_CRC_SEC_FAULT :1;  //  4
	uint16_t CFG_CRC_SEC_FAULT :1;   //  5
	uint16_t INT_COMM_SEC_FAULT :1;  //  6
	uint16_t GD_TSD_FAULT :1;        //  7
	uint16_t PS_TSD_FAULT :1;        //  8
	uint16_t OVLO23_FAULT :1;        //  9
	uint16_t UVLO23_FAULT :1;        // 10
	uint16_t GM_FAULT :2;            // 12:11
	uint16_t OC_FAULT :1;            // 13
	uint16_t SC_FAULT :1;            // 14
	uint16_t SPARE :1;               // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG9_REG_BITS bit;
} UCC5870_CFG9_REG;

enum {
	GM_FAULT_IGNORE = 0,
	GM_FAULT_ON_nFLT1 = 1,
	GM_FAULT_ON_nFLT2 = 2,
	GM_STATE_ON_nFLT2 = 3
};

enum {
	dont_report_TSD_on_nFLT1 = 0, report_TSD_on_nFLT1 = 1
};

// ==================================================================

//
// UCC5870 CFG10 Register bit definitions:
//
struct UCC5870_CFG10_REG_BITS {         // bit     description
	uint16_t FS_STATE_INT_COMM_SEC :2;  //  1:0
	uint16_t FS_STATE_GM :2;            //  3:2
	uint16_t FS_STATE_GD_TSD :2;        //  5:4
	uint16_t FS_STATE_PS_TSD :2;        //  7:6
	uint16_t FS_STATE_OCP :2;           //  9:8
	uint16_t rsvd10 :1;                 // 10
	uint16_t FS_STATE_INT_REG_FAULT :1; // 11
	uint16_t FS_STATE_DESAT_SCP :2;     // 13:12
	uint16_t SPARE :1;                  // 14
	uint16_t GD_TWN_SEC_EN :1;          // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG10_REG_BITS bit;
} UCC5870_CFG10_REG;

enum {
	PULLED_LOW = 0, PULLED_HIGH = 1, NO_ACTION = 3
};

enum {
	GD_TWN_SEC_DISABLED = 0, GD_TWN_SEC_ENABLED = 1
};

// ==================================================================

//
// UCC5870 CFG11 Register bit definitions:
//
struct UCC5870_CFG11_REG_BITS {               // bit     description
	uint16_t FS_STATE_CLK_MON_SEC_FAULT :2;   //  1:0
	uint16_t VCE_CLMP_HLD_TIME :2;            //  3:2
	uint16_t FS_STATE_CFG_CRC_SEC_FAULT :2;   //  5:4
	uint16_t FS_STATE_TRIM_CRC_SEC_FAULT :2;  //  7:6
	uint16_t FS_STATE_OVLO3 :2;               //  9:8
	uint16_t FS_STATE_UVLO3 :2;               // 11:10
	uint16_t FS_STATE_OVLO2 :2;               // 13:12
	uint16_t FS_STATE_UVLO2 :2;               // 15:14
};

typedef union {
	uint16_t all;
	struct UCC5870_CFG11_REG_BITS bit;
} UCC5870_CFG11_REG;

enum {
	VCE_CLAMP_HOLD_TIME_100ns = 0,
	VCE_CLAMP_HOLD_TIME_200ns = 1,
	VCE_CLAMP_HOLD_TIME_300ns = 2,
	VCE_CLAMP_HOLD_TIME_400ns = 3
};

// ==================================================================

//
// UCC5870 ADCDATA1 Register bit definitions:
//
struct UCC5870_ADCDATA1_REG_BITS { // bit     description
	uint16_t DATA_AI1 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA1_REG_BITS bit;
} UCC5870_ADCDATA1_REG;

// ==================================================================

//
// UCC5870 ADCDATA2 Register bit definitions:
//
struct UCC5870_ADCDATA2_REG_BITS { // bit     description
	uint16_t DATA_AI3 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA2_REG_BITS bit;
} UCC5870_ADCDATA2_REG;

// ==================================================================

//
// UCC5870 ADCDATA3 Register bit definitions:
//
struct UCC5870_ADCDATA3_REG_BITS { // bit     description
	uint16_t DATA_AI5 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA3_REG_BITS bit;
} UCC5870_ADCDATA3_REG;

// ==================================================================

//
// UCC5870 ADCDATA4 Register bit definitions:
//
struct UCC5870_ADCDATA4_REG_BITS { // bit     description
	uint16_t DATA_AI2 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA4_REG_BITS bit;
} UCC5870_ADCDATA4_REG;

// ==================================================================

//
// UCC5870 ADCDATA5 Register bit definitions:
//
struct UCC5870_ADCDATA5_REG_BITS { // bit     description
	uint16_t DATA_AI4 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA5_REG_BITS bit;
} UCC5870_ADCDATA5_REG;

// ==================================================================

//
// UCC5870 ADCDATA6 Register bit definitions:
//
struct UCC5870_ADCDATA6_REG_BITS { // bit     description
	uint16_t DATA_AI6 :10;         //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA6_REG_BITS bit;
} UCC5870_ADCDATA6_REG;

// ==================================================================

//
// UCC5870 ADCDATA7 Register bit definitions:
//
struct UCC5870_ADCDATA7_REG_BITS { // bit     description
	uint16_t DATA_DTEMP :10;       //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

