S-Batov/STM32_MCU_module/Core/Inc/ucc5870_regs.h
typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA7_REG_BITS bit;
} UCC5870_ADCDATA7_REG;

// ==================================================================

//
// UCC5870 ADCDATA8 Register bit definitions:
//
struct UCC5870_ADCDATA8_REG_BITS { // bit     description
	uint16_t DATA_OUTH :10;        //  9-0
	uint16_t TIME_STAMP :6;        // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCDATA8_REG_BITS bit;
} UCC5870_ADCDATA8_REG;

// ==================================================================

//
// UCC5870 CRCDATA Register bit definitions:
//
struct UCC5870_CRCDATA_REG_BITS { // bit     description
	uint16_t CRC_RX :8;           //  7-0
	uint16_t CRC_TX :8;           // 15-8
};

typedef union {
	uint16_t all;
	struct UCC5870_CRCDATA_REG_BITS bit;
} UCC5870_CRCDATA_REG;

// ==================================================================

//
// UCC5870 SPITEST Register bit definitions:
//
struct UCC5870_SPITEST_REG_BITS { // bit     description
	uint16_t rsvd :16;            // 15-10
};

typedef union {
	uint16_t all;
	struct UCC5870_SPITEST_REG_BITS bit;
} UCC5870_SPITEST_REG;

// ==================================================================

//
// UCC5870 GD_ADDR Register bit definitions:
//
struct UCC5870_GD_ADDR_REG_BITS { // bit     description
	uint16_t GD_ADDRESS :4;       //  3-0
	uint16_t rsvd :12;            // 15-4
};

typedef union {
	uint16_t all;
	struct UCC5870_GD_ADDR_REG_BITS bit;
} UCC5870_GD_ADDR_REG;

// ==================================================================

//
// UCC5870 STATUS1 Register bit definitions:
//
typedef struct UCC5870_STATUS1_REG_BITS { // bit     description
	uint16_t rsvd0 :1;                    //  0
	uint16_t GD_TWN_FAULT :1;             //  1
	uint16_t rsvd2 :3;                    //  4:2
	uint16_t PWM_COMP_CHK_FAULT :1;       //  5
	uint16_t OPM :3;                      //  8:6
	uint16_t rsvd9 :2;                    // 10:9
	uint16_t EN_STATE :1;                 // 11
	uint16_t rsvd12 :2;                   // 13:12
	uint16_t INN_STATE :1;                // 14
	uint16_t INP_STATE :1;                // 15
} UCC5870_STATUS1_REG_BITS;

typedef union {
	uint16_t all;
	struct UCC5870_STATUS1_REG_BITS bit;
} UCC5870_STATUS1_REG;

enum {
	NO_FAULT = 0, FAULT = 1
};

enum {
	LOW_ucc = 0, HIGH_ucc = 1
};

enum {
	OP_MODE_ERROR0 = 0,
	OP_MODE_CFG1 = 1,
	OP_MODE_CFG2 = 2,
	OP_MODE_ACTIVE = 3,
	OP_MODE_ERROR4 = 4,
	OP_MODE_ERROR5 = 5,
	OP_MODE_ERROR6 = 6,
	OP_MODE_ERROR7 = 7
};

//
// UCC5870 STATUS1 Register's FAULT bit mask definitions
//
#define  GD_TWN_FAULT_MASK         (1U << 1)
#define  PWM_COMP_CHK_FAULT_MASK   (1U << 5)

// ==================================================================

//
// UCC5870 STATUS2 Register bit definitions:
//
typedef struct UCC5870_STATUS2_REG_BITS { // bit     description
	uint16_t OR_NFLT2_PRI :1;             //  0
	uint16_t OR_NFLT1_PRI :1;             //  1
	uint16_t DRV_EN_RCVD :1;              //  2
	uint16_t TRIM_CRC_FAULT :1;           //  3
	uint16_t CFG_CRC_FAULT :1;            //  4
	uint16_t CLK_MON_FAULT :1;            //  5
	uint16_t BIST_FAULT :1;               //  6
	uint16_t INT_COMM_FAULT :1;           //  7
	uint16_t INT_REG_FAULT :1;            //  8
	uint16_t SPI_FAULT :1;                //  9
	uint16_t rsvd10 :1;                   // 10
	uint16_t STP_FAULT :1;                // 11
	uint16_t OVLO1_FAULT :1;              // 12
	uint16_t UVLO1_FAULT :1;              // 13
	uint16_t PRI_RDY :1;                  // 14
	uint16_t rsvd15 :1;                   // 15
} UCC5870_STATUS2_REG_BITS;

typedef union {
	uint16_t all;
	struct UCC5870_STATUS2_REG_BITS bit;
} UCC5870_STATUS2_REG;

enum {
	NOT_READY = 0, READY = 1
};

enum {
	DRIVER_NOT_ENABLED = 0, DRIVER_ENABLED = 1
};

//
// UCC5870 STATUS2 Register's FAULT bit mask definitions
//
#define  OR_NFLT2_MASK            (1U << 0)
#define  OR_NFLT1_MASK            (1U << 1)
#define  TRIM_CRC_FAULT_MASK      (1U << 3)
#define  CFG_CRC_FAULT_MASK       (1U << 4)
#define  CLK_MON_FAULT_MASK       (1U << 5)
#define  BIST_FAULT_MASK          (1U << 6)
#define  INT_COMM_FAULT_MASK      (1U << 7)
#define  INT_REG_FAULT_MASK       (1U << 8)
#define  SPI_FAULT_MASK           (1U << 9)
#define  STP_FAULT_MASK           (1U << 11)
#define  OVLO1_FAULT_MASK         (1U << 12)
#define  UVLO1_FAULT_MASK         (1U << 13)

// ==================================================================

//
// UCC5870 STATUS3 Register bit definitions:
//
typedef struct UCC5870_STATUS3_REG_BITS { // bit     description
	uint16_t DESAT_FAULT :1;              //  0
	uint16_t OC_FAULT :1;                 //  1
	uint16_t SC_FAULT :1;                 //  2
	uint16_t VREG2_ILIMIT_FAULT :1;       //  3
	uint16_t rsvd4 :1;                    //  4
	uint16_t PS_TSD_FAULT :1;             //  5
	uint16_t VCEOV_FAULT :1;              //  6
	uint16_t UVLO2_FAULT :1;              //  7
	uint16_t OVLO2_FAULT :1;              //  8
	uint16_t UVLO3_FAULT :1;              //  9
	uint16_t OVLO3_FAULT :1;              // 10
	uint16_t MCLP_STATE :1;               // 11
	uint16_t INT_COMM_SEC_FAULT :1;       // 12
	uint16_t INT_REG_SEC_FAULT :1;        // 13
	uint16_t GM_FAULT :1;                 // 14
	uint16_t GM_STATE :1;                 // 15
} UCC5870_STATUS3_REG_BITS;

typedef union {
	uint16_t all;
	struct UCC5870_STATUS3_REG_BITS bit;
} UCC5870_STATUS3_REG;

enum {
	NOT_ACTIVE = 0, ACTIVE = 1
};

//
// UCC5870 STATUS3 Register's FAULT bit mask definitions
//
#define  DESAT_FAULT_MASK         (1U << 0)
#define  OC_FAULT_MASK            (1U << 1)
#define  SC_FAULT_MASK            (1U << 2)
#define  VREG2_ILIMIT_FAULT_MASK  (1U << 3)
#define  PS_TSD_FAULT_MASK        (1U << 5)
#define  VCEOV_FAULT_MASK         (1U << 6)
#define  UVLO2_FAULT_MASK         (1U << 7)
#define  OVLO2_FAULT_MASK         (1U << 8)
#define  UVLO3_FAULT_MASK         (1U << 9)
#define  OVLO3_FAULT_MASK         (1U << 10)
#define  MCLP_STATE_MASK          (1U << 11)
#define  INT_COMM_SEC_FAULT_MASK  (1U << 12)
#define  INT_REG_SEC_FAULT_MASK   (1U << 13)
#define  GM_FAULT_MASK            (1U << 14)

// ==================================================================

//
// UCC5870 STATUS4 Register bit definitions:
//
typedef struct UCC5870_STATUS4_REG_BITS { // bit     description
	uint16_t SEC_RDY :1;                  //  0
	uint16_t rsvd :4;                     //  4:1
	uint16_t RIM_CRC_SEC_FAULT :1;        //  5
	uint16_t CFG_CRC_SEC_FAULT :1;        //  6
	uint16_t CLK_MON_SEC_FAULT :1;        //  7
	uint16_t BIST_SEC_FAULT :1;           //  8
	uint16_t OR_NFLT2_SEC :1;             //  9
	uint16_t OR_NFLT1_SEC :1;             // 10
	uint16_t rsvd11 :1;                   // 11
	uint16_t GD_TSD_SEC_FAULT :1;         // 12
	uint16_t GD_TWN_SEC_FAULT :1;         // 13
	uint16_t VCE_STATE :1;                // 14
	uint16_t rsvd15 :1;                   // 15
} UCC5870_STATUS4_REG_BITS;

