S-Batov/STM32_MCU_module/Core/Inc/ucc5870_regs.h
typedef union {
	uint16_t all;
	struct UCC5870_STATUS4_REG_BITS bit;
} UCC5870_STATUS4_REG;

//
// UCC5870 STATUS4 Register's FAULT bit mask definitions
//
#define  RIM_CRC_SEC_FAULT_MASK   (1U << 5)
#define  CFG_CRC_SEC_FAULT_MASK   (1U << 6)
#define  CLK_MON_SEC_FAULT_MASK   (1U << 7)
#define  BIST_SEC_FAULT_MASK      (1U << 8)
#define  OR_NFLT2_SEC_MASK        (1U << 9)
#define  OR_NFLT1_SEC_MASK        (1U << 10)
#define  GD_TSD_SEC_FAULT_MASK    (1U << 12)
#define  GD_TWN_SEC_FAULT_MASK    (1U << 13)

// ==================================================================

//
// UCC5870 STATUS5 Register bit definitions:
//
typedef struct UCC5870_STATUS5_REG_BITS { // bit     description
	uint16_t rsvd :15;                    // 14-0
	uint16_t ADC_FAULT :1;                // 15
} UCC5870_STATUS5_REG_BITS;

typedef union {
	uint16_t all;
	struct UCC5870_STATUS5_REG_BITS bit;
} UCC5870_STATUS5_REG;

//
// UCC5870 STATUS5 Register's FAULT bit mask definitions
//
#define ADC_FAULT_MASK            (1U << 15)

// ==================================================================

//
// UCC5870 CONTROL1 Register bit definitions:
//
struct UCC5870_CONTROL1_REG_BITS { // bit     description
	uint16_t CLK_MON_CHK_PRI :1;   //  0
	uint16_t rsvd4 :4;             //  4:1
	uint16_t STP_CHK :1;           //  5
	uint16_t rsvd6 :1;             //  6
	uint16_t PWM_COMP_CHK :1;      //  7
	uint16_t CFG_CRC_CHK_PRI :1;   //  8
	uint16_t rsvd14 :6;            // 14-9
	uint16_t CLR_SPI_CRC :1;       // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CONTROL1_REG_BITS bit;
} UCC5870_CONTROL1_REG;

// ==================================================================

//
// UCC5870 CONTROL2 Register bit definitions:
//
struct UCC5870_CONTROL2_REG_BITS { // bit     description
	uint16_t rsvd0 :1;             //  0
	uint16_t PS_TSD_CHK_SEC :1;    //  1
	uint16_t CFG_CRC_CHK_SEC :1;   //  2
	uint16_t CLK_MON_CHK_SEC :1;   //  3
	uint16_t RESERVED4 :1;         //  4
	uint16_t VGTH_MEAS :1;         //  5
	uint16_t rsvd6 :1;             //  6
	uint16_t OCP_CHK :1;           //  7
	uint16_t SCP_CHK :1;           //  8
	uint16_t DESAT_CHK :1;         //  9
	uint16_t rsvd10 :1;            // 10
	uint16_t VCECLP_CHK :1;        // 11
	uint16_t GATE_ON_CHK :1;       // 12
	uint16_t GATE_OFF_CHK :1;      // 13
	uint16_t rsvd14 :1;            // 14
	uint16_t CLR_STAT_REG :1;      // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_CONTROL2_REG_BITS bit;
} UCC5870_CONTROL2_REG;

// ==================================================================

//
// UCC5870 ADCCFG Register bit definitions:
//
struct UCC5870_ADCCFG_REG_BITS {    // bit     description
	uint16_t rsvd0 :1;              //  0
	uint16_t ADC_ON_CH_SEL_7 :1;    //  1
	uint16_t ADC_ON_CH_SEL_6 :1;    //  2
	uint16_t ADC_ON_CH_SEL_5 :1;    //  3
	uint16_t ADC_ON_CH_SEL_4 :1;    //  4
	uint16_t ADC_ON_CH_SEL_3 :1;    //  5
	uint16_t ADC_ON_CH_SEL_2 :1;    //  6
	uint16_t ADC_ON_CH_SEL_1 :1;    //  7
	uint16_t rsvd7 :1;              //  8
	uint16_t ADC_OFF_CH_SEL_7 :1;   //  9
	uint16_t ADC_OFF_CH_SEL_6 :1;   // 10
	uint16_t ADC_OFF_CH_SEL_5 :1;   // 11
	uint16_t ADC_OFF_CH_SEL_4 :1;   // 12
	uint16_t ADC_OFF_CH_SEL_3 :1;   // 13
	uint16_t ADC_OFF_CH_SEL_2 :1;   // 14
	uint16_t ADC_OFF_CH_SEL_1 :1;   // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_ADCCFG_REG_BITS bit;
} UCC5870_ADCCFG_REG;

enum {
	DONT_SAMPLE_CH = 0, SAMPLE_CH = 1
};

// ==================================================================

//
// UCC5870 DOUTCFG Register bit definitions:
//
struct UCC5870_DOUTCFG_REG_BITS { // bit     description
	uint16_t DOUT_TO_AI1 :1;      //  0
	uint16_t DOUT_TO_AI3 :1;      //  1
	uint16_t DOUT_TO_AI5 :1;      //  2
	uint16_t DOUT_TO_AI2 :1;      //  3
	uint16_t DOUT_TO_AI4 :1;      //  4
	uint16_t DOUT_TO_AI6 :1;      //  5
	uint16_t DOUT_TO_TJ :1;       //  6
	uint16_t rsvd :1;             //  7
	uint16_t FREQ_DOUT :2;        //  9:8
	uint16_t AI6OCSC_EN :1;       // 10
	uint16_t AI4OCSC_EN :1;       // 11
	uint16_t AI2OCSC_EN :1;       // 12
	uint16_t AI5OT_EN :1;         // 13
	uint16_t AI3OT_EN :1;         // 14
	uint16_t AI1OT_EN :1;         // 15
};

typedef union {
	uint16_t all;
	struct UCC5870_DOUTCFG_REG_BITS bit;
} UCC5870_DOUTCFG_REG;

enum {
	PROT_DISABLED = 0, PROT_ENABLED = 1
};

enum {
	FREQ_DOUT_13p9KHz = 0,
	FREQ_DOUT_27p8KHz = 1,
	FREQ_DOUT_55p7KHz = 2,
	FREQ_DOUT_111p4KHz = 3
};

enum {
	DONT_CONNECT_TO_DOUT = 0, CONNECT_TO_DOUT = 1
};

// ==================================================================
// ==================================================================
// ==================================================================
// ==================================================================
//TODO:

typedef struct {
	UCC5870_CFG1_REG cfg1;             // 0x00
	UCC5870_CFG2_REG cfg2;             // 0x01
	UCC5870_CFG3_REG cfg3;             // 0x02
	UCC5870_CFG4_REG cfg4;             // 0x03
	UCC5870_CFG5_REG cfg5;             // 0x04
	UCC5870_CFG6_REG cfg6;             // 0x05
	UCC5870_CFG7_REG cfg7;             // 0x06
	UCC5870_CFG8_REG cfg8;             // 0x07
	UCC5870_CFG9_REG cfg9;             // 0x08
	UCC5870_CFG10_REG cfg10;           // 0x09
	UCC5870_CFG11_REG cfg11;           // 0x0a
	UCC5870_ADCDATA1_REG adcdata1;     // 0x0b
	UCC5870_ADCDATA2_REG adcdata2;     // 0x0c
	UCC5870_ADCDATA3_REG adcdata3;     // 0x0d
	UCC5870_ADCDATA4_REG adcdata4;     // 0x0e
	UCC5870_ADCDATA5_REG adcdata5;     // 0x0f
	UCC5870_ADCDATA6_REG adcdata6;     // 0x10
	UCC5870_ADCDATA7_REG adcdata7;     // 0x11
	UCC5870_ADCDATA8_REG adcdata8;     // 0x12
	UCC5870_CRCDATA_REG crcdata;       // 0x13
	UCC5870_SPITEST_REG spitest;       // 0x14
	UCC5870_GD_ADDR_REG gd_address;    // 0x15
	UCC5870_STATUS1_REG status1;       // 0x16
	UCC5870_STATUS2_REG status2;       // 0x17
	UCC5870_STATUS3_REG status3;       // 0x18
	UCC5870_STATUS4_REG status4;       // 0x19
	UCC5870_STATUS5_REG status5;       // 0x1a
	UCC5870_CONTROL1_REG control1;     // 0x1b
	UCC5870_CONTROL2_REG control2;     // 0x1c
	UCC5870_ADCCFG_REG adccfg;         // 0x1d
	UCC5870_DOUTCFG_REG doutcfg;       // 0x1e
} UCC5870_Vars;

#define UCC5870_DEFAULTS            \
{                                   \
        0,     /* cfg1         */   \
        0,     /* cfg2         */   \
        0,     /* cfg3         */   \
        0,     /* cfg4         */   \
        0,     /* cfg5         */   \
        0,     /* cfg6         */   \
        0,     /* cfg7         */   \
        0,     /* cfg8         */   \
        0,     /* cfg9         */   \
        0,     /* cfg10        */   \
        0,     /* cfg11        */   \
        0,     /* adcdata1     */   \
        0,     /* adcdata2     */   \
        0,     /* adcdata3     */   \
        0,     /* adcdata4     */   \
        0,     /* adcdata5     */   \
        0,     /* adcdata6     */   \
        0,     /* adcdata7     */   \
        0,     /* adcdata8     */   \
        0,     /* crcdata      */   \
        0,     /* spitest      */   \
        0,     /* gd_address   */   \
        0,     /* status1      */   \
        0,     /* status2      */   \
        0,     /* status3      */   \
        0,     /* status4      */   \
        0,     /* status5      */   \
        0,     /* control1     */   \
        0,     /* control2     */   \
        0,     /* adccfg       */   \
        0      /* doutcfg      */   \
}

// ==================================================================
// ==================================================================
// ==================================================================
// ==================================================================
// ==================================================================
// ==================================================================
// ==================================================================

#endif  // _UCC5870_REGS_H
